{"pages":[{"title":"Ben Kimim ?","text":"ÖzetKısa bir özet Eğitim HayatımEğitim bilgileri İş Deneyimlerimİş deneyimleri ile ilgili bilgiler HedeflerimKariyerimde ulaşmak istedilerim","link":"/benkimim/index.html"}],"posts":[{"title":"Stencil'e Giriş","text":"Nedir?Stencil Ionic ekibi tarafından geliştirilen native web bileşenleri oluşturmak için hazırlanan bir araçtır. Bunun yanında sanal dom, reaktif veri aktarımı Typescript ve JSX gibi güçlü özellikleri ile uzun vade de oldukça iddialı ve umut verici görünüyor. İlk olarak Polymer Summit 2017 de duyurulan Stencil ben de dahil olmak üzere bir çok kişinin ilgisini çekmiş gibi görünüyor. Bu yazı ile kısa bir giriş yaparak basit bir örnek uygulama hazırlayacağız. Neden?Ekip Ionic bileşenlerinin bir sonraki sürümünü Stencil ile geliştirecek. Bu Ionic ile geliştirilmiş olan uygulamalara ciddi bir hız katacak ve aynı zamanda ciddi bir paket boyutu avantajı sağlayacak gibi görünüyor. Bunun yanı sıra Angular 4 ile Ionic uygulamarı geliştirmek hala mümkün olacak ve daha da önemlisi ve bana çok cazip gelen tarafı Angular 4 dışında Vue, React ve hatta saf Javascript ile ionic uygulamaları geliştirmek mümkün hale gelecek. Yani kısacası framework yada kütüphane bağımsız bir bileşen setine dönüşecek. Gerçekten kulağa çok hoş geliyor. Dikkat: Stencil henüz alpha bile diyemeyeceğimiz çok ama çok erken bir sürümde. Bu nedenle ilk kararlı sürüm yayınlanana kadar dikkatli olunması ve değişimlerin iyi izlenmesi gerekmektedir. Çünkü bazı klavye bükücü anlamsız hatalar ve kararlı sürüme kadar bolca “breaking change” bizleri bekliyor olabilir. KurulumŞu anda Stencil çok erken bir aşamada olduğu için bir cli aracı bulunmuyor. Bu nedenle hızlıca bir göz atmanın en iyi yolu ekip tarafından github üzerindeki başlangıç uygulaması reposunu bilgisayarımıza klonlamak (git clone)olacaktır. O zaman başlayalım: 1$ git clone https://github.com/ionic-team/stencil-starter.git ilk-stencil-ornegi Klonlama işlemi tamamlandıktan sonra bağımlılıklar için klasör içerisine girip npm yada yarn ile yükleme işlemini tamamlıyoruz. 1234$ cd ilk-stencil-ornegi$ npm install#veya yarn için$ yarn Yükleme işlemi tamamlandıktan sonra projeyi yerel bir sunucu üzerinde ayağa kaldırmak için şu komutu çalıştırıyoruz: 123$ npm start# veya yarn için$ yarn start Hadi BaşlayalımStencil bileşenleri Typescript ve JSX kullanılarak oluşturuluyorlar. Bu hem Angular severlere hemde React severlere göz kırpıyor. Vue severler için zaten bir şey söylememe gerek yok. Kim gözünü nereye kırpsa sekip onlara geliyor. :) Bileşenler /src/components/ klasöründe bulunuyor. Bir bileşenin yapısına kısaca bir göz atmak istersek (my-name.tsx): 12345678910111213141516import { Component, Prop } from \"@stencil/core\";@Component({ tag: \"my-name\", styleUrl: \"my-name.scss\"})export class MyName { @Prop() first: string; @Prop() last: string; render() { return ( &lt;p&gt; Hello, my name is {this.first} {this.last} &lt;/p&gt; ); }} @Component: Bileşen için gereken meta verilerin tanımlanması için kullanılan dekorator. Bazı özellikleri tag, styleUrl, styleUrls. @Prop: Bileşenin kabul ettiği öz niteliklerin değerlerini ele alırken kullanılan dekorator. Örneğin @Prop() adi: string = ; Bu bileşenin Stencil yapılandırma dosyasında tanımlanması gerekmektedir. Kontrol etmek için ana dizinde bulunan stencil.config.js dosyasına göz atalım: 1234exports.config = { bundles: [{ components: [\"my-name\", \"diger-bilesen\"] }]};//... Artık bileşeni index.html içerisinde tag adı ile kullanabiliriz: 1234567891011&lt;!DOCTYPE html&gt;&lt;html dir=\"ltr\" lang=\"en\"&gt; &lt;head&gt; &lt;meta charset=\"utf-8\" /&gt; &lt;title&gt;Stencil Starter App&lt;/title&gt; &lt;script src=\"build/app.js\"&gt;&lt;/script&gt; &lt;/head&gt; &lt;body&gt; &lt;my-name first=\"Stencil\" last=\"JS\"&gt;&lt;/my-name&gt; &lt;/body&gt;&lt;/html&gt; Kendi Bileşenimizi GeliştirelimÖncelikle bileşeni geliştirmeye başlamadan önce ilk kez kullanacağımız 3 yeni kavrama bir göz atalım. @State() : Bileşen içerisinde kullanacağımız değişkenleri belirttiğimiz dekarator. Örneğin, @State() deger: number; componentWillLoad : Yaşam döngüsü kancalarından bir tanesi. Bileşen yüklenmeden önce çalıştırılır. Diğerleri, componentDidLoad ve componentDidUnload. componentDidLoad, bileşen yüklendikten sonra componentDidUnload ise bileşen kaldırıldığında çalıştırılır. onClick : Buttona tıklama olayını ele alacağımız event. Örneğin, onClick={() =&gt; this.artir()} Şimdi ilk olarak /src/components/ dizinin içerisine ornek-sayac adında yeni bir bileşen dizini oluşturalım. Şimdi ise içerisine ornek-sayac.tsx ve ornek-sayac.scss dosyalarını oluşturalım. Son görünüm aşağıdaki gibi. Daha sonra yeni bileşenimizi stencil’e haber vermemiz gerekiyor. Bunun için stencil.config.js içerisindeki components string dizisine yeni bileşenimizi ekleyelim. 1234exports.config = { bundles: [{ components: [\"my-name\", \"ornek-sayac\"] }]};//... Şimdi ornek-sayac.tsx dosyasını açalım ve aşağıdaki şekilde düzenleyelim. 1234567891011121314151617181920212223242526272829303132import { Component, Prop, State } from \"@stencil/core\";@Component({ tag: \"ornek-sayac\", styleUrl: \"ornek-sayac.scss\"})export class OrnekSayac { @Prop() baslangic: number = 1; @Prop() artismiktari: number = 5; @State() deger: number; componentWillLoad() { this.deger = this.baslangic; } render() { return ( &lt;p&gt; &lt;button onClick={() =&gt; this.azalt()}&gt;Azalt&lt;/button&gt; &lt;span class=\"sonuc\"&gt;{this.deger}&lt;/span&gt; &lt;button onClick={() =&gt; this.artir()}&gt;Artır&lt;/button&gt; &lt;/p&gt; ); } artir() { const yeniDeger = this.deger + this.artismiktari; this.deger = yeniDeger; } azalt() { const yeniDeger = this.deger - this.artismiktari; this.deger = yeniDeger; }}//... Şimdi ise isteğe bağlı olarak ornek-sayac.scss dosyasını aşağıdaki gibi düzenleyebilirsiniz. 12345678button { font-size: 20px;}.sonuc { padding: 0 10px 0 10px; font-size: 20px; font-weight: bold;} Ve bileşenimiz hazır durumda. Son olarak bileşeni index.html‘e eklemeliyiz. 12345678910111213&lt;!DOCTYPE html&gt;&lt;html dir=\"ltr\" lang=\"en\"&gt; &lt;head&gt; &lt;meta charset=\"utf-8\" /&gt; &lt;title&gt;Stencil Starter App&lt;/title&gt; &lt;script src=\"build/app.js\"&gt;&lt;/script&gt; &lt;/head&gt; &lt;body&gt; &lt;my-name first=\"Stencil\" last=\"JS\"&gt;&lt;/my-name&gt; &lt;ornek-sayac&gt;&lt;/ornek-sayac&gt; &lt;!-- &lt;ornek-sayac baslangic=\"5\" artismiktari=\"10\"&gt;&lt;/ornek-sayac&gt; --&gt; &lt;/body&gt;&lt;/html&gt; Sonuç aşağıdaki gibi olmalı. Bu yazı ile temel anlamda Stencil aracına bir giriş yapmış olduk. Yeni konularla bu yazı dizisini devam ettirmeye çalışacağım. Herkese iyi çalışmalar dilerim.","link":"/2019/05/15/stencil-e-giris/"},{"title":"Stencil’de Bileşenler Arası Haberleşme","text":"Stencil aracının ne olduğuna bir önceki yazımda giriş seviyesinde değinmeye çalışmıştım. Şimdi biraz daha derinlerine inmeye çalışacağım. Bileşen temelli araçların hemen tümünde bileşenler arası haberleşme/etkileşim (component communication/interaction) önem arz eder. Bu nedenle değineceğim ilk konu bu olacak. Stencil aracında bileşenler arasındaki haberleşme Üst Bileşenden Alt Bileşene (Parent to Child), Alt Bileşenden Üst Bileşene (Child to Parent) olmak üzere iki şekilde gerçekleşmektedir. Aşağıdaki hazırladığım görsel ile basit bir şekilde bu haberleşmeyi anlatmaya çalıştım. Üst Bileşen’den Alt Bileşene (Parent to Child)Bileşenler arasındaki haberleşmenin en anlaşılır ve kolay olanıdır. Alt bileşen içerisinde bir @Prop() tanımlanır ve özellik olarak değer ataması yapılır. Basit bir örnek ile gösterecek olursak : Not: Örnek dilini belki makaleyi yabancı okurlarda inceleyebilir diye affınıza sığınarak İngilizce tutmaya çalışacağım. 123456//*** profile-image.tsx@Prop() imageUrl: string = '';render(){ return(&lt;img src={this.imageUrl} alt=\"My profile image\" /&gt;)}//*** Alt bileşenimiz de imgUrl adında bir özellik alabileceğimizi belirtiyoruz. Ve gelen veriyi img tagının src’sine aktarıyoruz. Daha sonra bu bileşeni kullanacak olan profile bileşenini düzenliyoruz: 123456789101112131415//*** profile.tsx@State() currentUser: any = {name:'Selçuk Kütük',image:'http://localhost:3333/img/profileimg.jpeg'}render(){return ( &lt;div&gt; &lt;h3&gt;Hello {this.currentUser.name}&lt;/h3&gt; &lt;hr /&gt; &lt;profile-image image-url={this.currentUser.image}&gt;&lt;/profile-image&gt; )}//*** Profile bileşenin içerisinde profile-image bileşenini kullanırken bu bileşenin image-url özelliğine profile bileşeninde bulunan currentUser nesnesinin image özelliğini gönderiyoruz. Not: Süslü parantez (curly braces) “{}” JSX söz diziminde Javascript’e geçtiğinizi belirtmek için kullanılır. Böylece bileşen içerisinde yer alan bir değişkenin değerini bir html özelliğine aktarabiliriz. 1&lt;profile&gt;&lt;/profile&gt; Alt Bileşen’den Üst Bileşene (Child to Parent)Mantığı basit olmasına karşın anlaşılması ilk haberleşme şekline göre biraz daha zordur. Öncelikle sorunu bir tanımlayalım. Bu haberleşmede amiyane tabirle bileşen elimizin altında değil. Aksi gibi elimizin üstünde :). Bu nedenle Alt bileşende gerçekleşen bir olaydan haberdar olmak ve varsa gerçekleşen olayın sonucunda oluşan değeri de elde etmek istiyoruz. İşte tam burada 3 yeni kavram karşımıza çıkıyor. @Event() ve @Listen() dekarator’ü, EventEmitter arayüzü. @Event(): Tanımlanacak değişkenin üst bileşenlere haber göndereceğini işaretlemeye yarayan dekarator. Örneğin, @Event() profileImageUpdated: EventEmitter; EventEmitter: Tanımlanan değişkenin tipini ifade eder. İçerisinde bulunan emit methodu ile Üst bileşenlere haber ve gerekirse veri gönderir. Örneğin, profileImageUpdated.emit(‘http://localhost:3333/img/newprofileimg.jpeg’) @Listen(): Üst bileşende işaretlenen method ile Alt bileşendeki gerçekleşen bir olaydan haberdar olunmasını sağlayan dekarator. Örneğin, @Listen(‘profileImageUpdated’) showInfo(event: CustomEvent){console.log(event.detail)} O zaman ilk örneğimizi bu yeni konu ile genişletelim: Not: Event, EventEmitter, Listen @stencil/core kütüphanesinde yer almaktadır. Dahil etmeyi unutmayın. 1import {Event, EventEmitter, Listen} from ‘@stencil/core’; Şimdi profile-image bileşeninde ki işlemleri gerçekleştirelim. 1234567891011121314//*** profile-image.tsx@Prop() imageUrl: string = '';@Event() profileImageUpdated: EventEmitter;updateProfileImage(){ let newProfileImageUrl = '...'; this.profileImageUpdated(newProfileImageUrl);}render(){ return( &lt;button onClick={() =&gt; this.updateProfileImage()}&gt;Update&lt;/button&gt; &lt;img src={this.imageUrl} alt=\"My profile image\" /&gt; )}//*** Şimdi ise profile bileşeninde ki işlemleri gerçekleştirelim. 123456789101112131415161718192021222324252627//*** profile.tsx@State() currentUser: any = { name:'Selçuk Kütük', image:'http://localhost:3333/img/profileimg.jpeg'}@State() newProfileUrl: string = '';@Listen('profileImageUpdated')profileImageUpdatedHandler(event: CustomEvent){ this.newProfileUrl = event.detail;}render(){ return ( { this.imageUrl !== '' &amp;&amp; &lt;span&gt; Profile image updated. New image: &lt;img src={this.newProfileUrl} alt=\"New image\" /&gt; &lt;/span&gt; } &lt;h3&gt;Hello {this.currentUser.name}&lt;/h3&gt; &lt;hr /&gt; &lt;profile-image image-url={this.currentUser.img}&gt;&lt;/profile-image&gt; )}//*** Şimdi haberleşmenin keyfini çıkaralım. Stencil yazı dizisinin ikincisinde bileşenler arasındaki haberleşmeyi ele almaya çalıştım. Bir sonraki konuda görüşmek üzere. Herkese iyi çalışmalar dilerim.","link":"/2019/05/16/stencilde-bilesenler-arasi-haberlesme/"}],"tags":[{"name":"stenciljs","slug":"stenciljs","link":"/tags/stenciljs/"},{"name":"web components","slug":"web-components","link":"/tags/web-components/"},{"name":"bileşen iletişimi","slug":"bilesen-iletisimi","link":"/tags/bilesen-iletisimi/"}],"categories":[{"name":"Web Components","slug":"Web-Components","link":"/kategoriler/Web-Components/"}]}